InformationRegisters/КомандировкиВСистемеБронирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КомандировкиВСистемеБронирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПоездки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Командировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КомандировкиСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВерсияЗаказаБронированияКомандировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВерсияЗаказаБронированияКомандировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СистемаБронирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыБронированияКомандировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗаявокСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокСотрудников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыТранспортаБронированияБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаБронированияБилетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самолет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поезд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыУслугБронированияКомандировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыУслугБронированияКомандировок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Билеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трансфер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КомандировкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КомандировкиСотрудников</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаКомандировку</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейВПути</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияНазначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомандировкаЗаСчетСредств</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Командировка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/БронированиеКомандировокКорпоративный/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.РегистрыСведений.КомандировкиВСистемеБронирования, Истина);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузитьПоездкиЗаПериодДлительнаяОперация", Истина);
	Методы.Вставить("СформироватьПриказыДлительнаяОперация", Истина);
	Методы.Вставить("ЗагрузитьНовыеПоездкиДлительнаяОперация", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

Процедура ПроверитьЗаявкуНаБронированиеКомандировкиОбработкаПроверкиЗаполнения(ЗаявкаОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	// Перечисляем все реквизиты, относящиеся к бронированию.
	// Будем удалять из удаляемых только те, которые нужно проверить.
	
	РеквизитыБронирования = Новый Массив;
	ЗаполнитьРеквизитыБронированияКомандировокДляПроверкиЗаполнения(РеквизитыБронирования);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьБронированиеКомандировок") Тогда 
		// Удаляем все реквизиты.
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, РеквизитыБронирования);
		Возврат;
	КонецЕсли;
	
	ПроверитьЛичныеДанныеЗаявкиНаБронирование(ЗаявкаОбъект, Отказ, РеквизитыБронирования);
	ПроверитьДанныеБилетовЗаявкиНаБронирование(ЗаявкаОбъект, Отказ, РеквизитыБронирования);
	ПроверитьДанныеПроживанияЗаявкиНаБронирование(ЗаявкаОбъект, Отказ, РеквизитыБронирования);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, РеквизитыБронирования);
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеЗаявкиНаБронированиеКомандировкиПриЗаписи(ЗаявкаОбъект, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЗаявкаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьБронированиеКомандировок") Тогда 
		Возврат;
	КонецЕсли;
	
	// Задача метода - установить состояние бронирования Подготовлена в случае, 
	// если данные заявки требуется передать в систему бронирования
	// - заявка согласована и требуется бронирование,
	// - заявка согласована и произошли изменения бронирования (вплоть до отмены),
	// - заявка не согласована, но была согласована (нужно отменить бронирование).
	
	НоваяЗаявка = Ложь;
	СогласованиеОтменено = Ложь;
	СогласованиеУстановлено = Ложь;
	
	ПрежнийОбъект = Неопределено;
	ЗаявкаОбъект.ДополнительныеСвойства.Свойство("ПрежнийОбъект", ПрежнийОбъект);
	Если ПрежнийОбъект = Неопределено Тогда
		НоваяЗаявка = Истина;
	Иначе
		Если ЗаявкаОбъект.Статус <> ПрежнийОбъект.Статус Тогда
			Если ПрежнийОбъект.Статус = Перечисления.СтатусыЗаявокСотрудников.Согласовано Тогда
				СогласованиеОтменено = Истина;
			КонецЕсли;
			Если ЗаявкаОбъект.Статус = Перечисления.СтатусыЗаявокСотрудников.Согласовано Тогда
				СогласованиеУстановлено = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СогласованиеОтменено Тогда
		Если ЗаявкаОбъект.БронироватьБилеты Или ЗаявкаОбъект.БронироватьПроживание 
			Или ПрежнийОбъект.БронироватьБилеты Или ПрежнийОбъект.БронироватьПроживание Тогда
			БронированиеКомандировокРасширенный.УстановитьСостояниеЗаявкиПодготовлена(ЗаявкаОбъект);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ЗаявкаОбъект.Статус <> Перечисления.СтатусыЗаявокСотрудников.Согласовано Тогда
		Возврат;
	КонецЕсли;
	
	Если СогласованиеУстановлено Или НоваяЗаявка Тогда
		Если ЗаявкаОбъект.БронироватьБилеты Или ЗаявкаОбъект.БронироватьПроживание Тогда
			БронированиеКомандировокРасширенный.УстановитьСостояниеЗаявкиПодготовлена(ЗаявкаОбъект);
		КонецЕсли;
	Иначе
		Если Не ДанныеБронированияЗаявкиИдентичны(ПрежнийОбъект, ЗаявкаОбъект) Тогда
			БронированиеКомандировокРасширенный.УстановитьСостояниеЗаявкиПодготовлена(ЗаявкаОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаЗаполненияЗаявки

Процедура ЗаполнитьРеквизитыБронированияКомандировокДляПроверкиЗаполнения(РеквизитыБронирования)
	
	РеквизитыБронирования.Добавить("Организация");

	РеквизитыБронирования.Добавить("ФамилияВПаспорте");
	РеквизитыБронирования.Добавить("ИмяВПаспорте");
	РеквизитыБронирования.Добавить("Гражданство");
	РеквизитыБронирования.Добавить("ВидПаспорта");
	РеквизитыБронирования.Добавить("НомерПаспорта");
	РеквизитыБронирования.Добавить("ФамилияЛатиницей");
	РеквизитыБронирования.Добавить("ИмяЛатиницей");
	РеквизитыБронирования.Добавить("ДатаРождения");
	РеквизитыБронирования.Добавить("Телефон");
	РеквизитыБронирования.Добавить("EMail");
	
	РеквизитыБронирования.Добавить("ДатаОтправленияТуда");
	РеквизитыБронирования.Добавить("ДатаОтправленияОбратно");

	РеквизитыБронирования.Добавить("ГородВылета");
	РеквизитыБронирования.Добавить("ГородВылетаПредставление");
	РеквизитыБронирования.Добавить("ГородПрилета");
	РеквизитыБронирования.Добавить("ГородПрилетаПредставление");

	РеквизитыБронирования.Добавить("СтанцияОтправления");
	РеквизитыБронирования.Добавить("СтанцияОтправленияПредставление");
	РеквизитыБронирования.Добавить("СтанцияПрибытия");
	РеквизитыБронирования.Добавить("СтанцияПрибытияПредставление");
	
	РеквизитыБронирования.Добавить("МестоПроживания");
	РеквизитыБронирования.Добавить("МестоПроживанияПредставление");
	РеквизитыБронирования.Добавить("ДатаЗаездаПроживания");
	РеквизитыБронирования.Добавить("ДатаВыездаПроживания");
	
КонецПроцедуры

Процедура ПроверитьЛичныеДанныеЗаявкиНаБронирование(ЗаявкаОбъект, Отказ, РеквизитыБронирования)
	
	Если Не ЗаявкаОбъект.БронироватьБилеты И Не ЗаявкаОбъект.БронироватьПроживание Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "Организация");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ФамилияВПаспорте");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ИмяВПаспорте");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "Гражданство");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ВидПаспорта");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "НомерПаспорта");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ФамилияЛатиницей");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ИмяЛатиницей");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ДатаРождения");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "Телефон");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "EMail");
	
	Если ЗначениеЗаполнено(ЗаявкаОбъект.ДатаРождения) Тогда
		Если ЗаявкаОбъект.ДатаРождения < Дата(1900, 1, 1) Тогда
			ТекстСообщения = НСтр("ru = 'Дата рождения задана неверно.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаРождения", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДанныеБилетовЗаявкиНаБронирование(ЗаявкаОбъект, Отказ, РеквизитыБронирования)
	
	Если Не ЗаявкаОбъект.БронироватьБилеты Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ДатаОтправленияТуда");
	
	Если ЗначениеЗаполнено(ЗаявкаОбъект.ДатаОтправленияТуда) Тогда
		Если ЗаявкаОбъект.ДатаОтправленияТуда < ЗаявкаОбъект.ДатаНачала - ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() Тогда
			ТекстСообщения = НСтр("ru = 'Дата отправления раньше начала командировки.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаОтправленияТуда", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗаявкаОбъект.БилетВОдинКонец Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ДатаОтправленияОбратно");
		Если ЗначениеЗаполнено(ЗаявкаОбъект.ДатаОтправленияОбратно) Тогда
			Если ЗаявкаОбъект.ДатаОтправленияОбратно > ЗаявкаОбъект.ДатаОкончания Тогда
				ТекстСообщения = НСтр("ru = 'Дата отправления обратно позже окончания командировки.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаОтправленияОбратно", , Отказ);
			КонецЕсли;
			Если ЗаявкаОбъект.ДатаОтправленияОбратно < ЗаявкаОбъект.ДатаОтправленияТуда Тогда
				ТекстСообщения = НСтр("ru = 'Дата отправления обратно раньше отправления туда.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаОтправленияОбратно", , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаявкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаБронированияБилетов.Самолет Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ГородВылета");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ГородВылетаПредставление");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ГородПрилета");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ГородПрилетаПредставление");
		Если Не ЗначениеЗаполнено(ЗаявкаОбъект.ГородВылета) Тогда
			ТекстСообщения = НСтр("ru = 'Неверно задан город вылета.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ГородВылетаПредставление", , Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЗаявкаОбъект.ГородПрилета) Тогда
			ТекстСообщения = НСтр("ru = 'Неверно задан город прилета.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ГородПрилетаПредставление", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаявкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаБронированияБилетов.Поезд Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "СтанцияОтправления");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "СтанцияОтправленияПредставление");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "СтанцияПрибытия");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "СтанцияПрибытияПредставление");
		Если Не ЗначениеЗаполнено(ЗаявкаОбъект.СтанцияОтправления) Тогда
			ТекстСообщения = НСтр("ru = 'Неверно задана станция отправления.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.СтанцияОтправленияПредставление", , Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЗаявкаОбъект.СтанцияПрибытия) Тогда
			ТекстСообщения = НСтр("ru = 'Неверно задана станция прибытия.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.СтанцияПрибытияПредставление", , Отказ);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьДанныеПроживанияЗаявкиНаБронирование(ЗаявкаОбъект, Отказ, РеквизитыБронирования)
	
	Если Не ЗаявкаОбъект.БронироватьПроживание Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "МестоПроживания");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "МестоПроживанияПредставление");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ДатаЗаездаПроживания");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(РеквизитыБронирования, "ДатаВыездаПроживания");
	
	Если ЗначениеЗаполнено(ЗаявкаОбъект.ДатаЗаездаПроживания) Тогда
		Если ЗаявкаОбъект.ДатаЗаездаПроживания < ЗаявкаОбъект.ДатаНачала Тогда
			ТекстСообщения = НСтр("ru = 'Дата заезда раньше начала командировки.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаЗаездаПроживания", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаявкаОбъект.ДатаВыездаПроживания) Тогда
		Если ЗаявкаОбъект.ДатаВыездаПроживания > ЗаявкаОбъект.ДатаОкончания Тогда
			ТекстСообщения = НСтр("ru = 'Дата выезда позже окончания командировки.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаВыездаПроживания", , Отказ);
		КонецЕсли;
		Если ЗаявкаОбъект.ДатаВыездаПроживания < ЗаявкаОбъект.ДатаЗаездаПроживания Тогда
			ТекстСообщения = НСтр("ru = 'Дата выезда раньше заезда.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ДатаВыездаПроживания", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаявкаОбъект.МестоПроживания) Тогда
		ТекстСообщения = НСтр("ru = 'Неверно задано место проживания.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.МестоПроживанияПредставление", , Отказ);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

Функция ДанныеБронированияЗаявкиИдентичны(ЗаявкаОбъект1, ЗаявкаОбъект2)
	
	ДанныеБронирования1 = БронированиеКомандировокРасширенный.ТаблицаПоездок();
	ДанныеЗаявки1 = БронированиеКомандировокРасширенный.НовоеОписаниеДанныеЗаявки();
	ЗаполнитьЗначенияСвойств(ДанныеЗаявки1, ЗаявкаОбъект1);
	ДанныеЗаявки1.Согласована = (ЗаявкаОбъект1.Статус = Перечисления.СтатусыЗаявокСотрудников.Согласовано);
	БронированиеКомандировокРасширенный.ДобавитьПоездкуКДаннымБронирования(ДанныеБронирования1, ДанныеЗаявки1);
	
	ДанныеБронирования2 = БронированиеКомандировокРасширенный.ТаблицаПоездок();
	ДанныеЗаявки2 = БронированиеКомандировокРасширенный.НовоеОписаниеДанныеЗаявки();
	ЗаполнитьЗначенияСвойств(ДанныеЗаявки2, ЗаявкаОбъект2);
	ДанныеЗаявки2.Согласована = (ЗаявкаОбъект1.Статус = Перечисления.СтатусыЗаявокСотрудников.Согласовано);
	БронированиеКомандировокРасширенный.ДобавитьПоездкуКДаннымБронирования(ДанныеБронирования2, ДанныеЗаявки2);
	
	Возврат ЗначениеВСтрокуВнутр(ДанныеБронирования1) = ЗначениеВСтрокуВнутр(ДанныеБронирования2);
	
КонецФункции

#Область ДлительныеОперации

Процедура ЗагрузитьНовыеПоездкиДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	Результат = Новый Структура(
		"Поездки,
		|Версия");
	
	Версия = ВерсияПоследнегоЗаказа(Параметры.СистемаБронирования, Параметры.Организация);
	Если ЗначениеЗаполнено(Версия) Тогда
		Версия = Версия + 1;
	КонецЕсли;
	
	Результат.Поездки = НовыеПоездки(Версия, Параметры.Организация);
	Результат.Версия = Версия;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Процедура ЗагрузитьПоездкиЗаПериодДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	Результат = Новый Структура("Поездки");
	Результат.Поездки = ПоездкиЗаПериод(Параметры.Период, Параметры.Организация);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Процедура СформироватьПриказыДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	ДанныеПоездок = Параметры.ДанныеПоездок;
	
	Для Каждого СтрокаДанных Из ДанныеПоездок Цикл
		НачатьТранзакцию();
		Попытка
			СформироватьКомандировку(СтрокаДанных);
			СохранитьИдентификаторПоездки(СтрокаДанных);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			БронированиеКомандировокРасширенный.ЗарегистрироватьОшибкуБронированияКомандировок(ИнформацияОбОшибке(), НСтр("ru = 'Формирование кадровых приказов'"));
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
	Командировки = ДанныеПоездок.ВыгрузитьКолонку("Командировка");
	ДанныеКомандировок = Документы.Командировка.ДанныеКомандировок(Командировки);
	ДанныеКомандировокГруппой = Документы.КомандировкиСотрудников.ДанныеКомандировок(Командировки);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ДанныеКомандировок, ДанныеКомандировокГруппой);
	
	Для Каждого СтрокаДанных Из ДанныеПоездок Цикл
		СравнитьДанныеПоездки(СтрокаДанных, ДанныеКомандировок[СтрокаДанных.Командировка]);
	КонецЦикла;
	
	Результат = Новый Структура("ДанныеПоездок");
	Результат.ДанныеПоездок = ДанныеПоездок;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаПоездок

#Область Поездки


Функция НовыеПоездки(Версия, Организация)
	
	Поездки = БронированиеКомандировокРасширенный.ТаблицаПоездок();
	
	ИнтеграцияSmartwayРасширенный.ЗагрузитьНовыеПоездки(Поездки, Версия, Организация);
	
	ОбработатьЗагруженныеПоездки(Поездки);
	
	Возврат Поездки;
	
КонецФункции

Функция ПоездкиЗаПериод(Период, Организация)
	
	Поездки = БронированиеКомандировокРасширенный.ТаблицаПоездок();
	
	ИнтеграцияSmartwayРасширенный.ЗагрузитьПоездкиЗаПериод(Поездки, Период, Организация);
	
	ОбработатьЗагруженныеПоездки(Поездки);
	
	Возврат Поездки;
	
КонецФункции

Процедура ОбработатьЗагруженныеПоездки(Поездки)
	
	Если Поездки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПодобратьОрганизации(Поездки);
	РазбитьПоездкиПоОрганизациям(Поездки);
	БронированиеКомандировокРасширенный.ПодобратьФизическихЛиц(Поездки);
	ПодобратьСотрудников(Поездки);
	СобратьФизическихЛицПоездки(Поездки);
	ЗаполнитьПредставлениеПоездок(Поездки);
	ПодобратьСуществующиеКомандировки(Поездки);
	
КонецПроцедуры

#КонецОбласти

Функция ПредставлениеПериодаПоездки(Поездка)
	
	ПериодПоездки = "";
	
	Если НачалоДня(Поездка.ДатаНачала) = НачалоДня(Поездка.ДатаОкончания) Тогда
		ПериодПоездки = БронированиеКомандировокРасширенный.ДатаВСтроку(Поездка.ДатаНачала);
	Иначе
		ПериодПоездки = СтрШаблон("%1 - %2", БронированиеКомандировокРасширенный.ДатаВСтроку(Поездка.ДатаНачала), БронированиеКомандировокРасширенный.ДатаВСтроку(Поездка.ДатаОкончания));
	КонецЕсли;
	
	Возврат ПериодПоездки;
	
КонецФункции

Процедура ПодобратьОрганизации(Поездки)
	
	РазличныеИНН = Новый Соответствие;
	Для Каждого Поездка Из Поездки Цикл
		Для Каждого Услуга Из Поездка.Услуги Цикл
			УслугиПоИНН = РазличныеИНН[Услуга.ИННОрганизации];
			Если УслугиПоИНН = Неопределено Тогда
				УслугиПоИНН = Новый Массив;
			КонецЕсли;
			УслугиПоИНН.Добавить(Услуга);
			РазличныеИНН.Вставить(Услуга.ИННОрганизации, УслугиПоИНН);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из РазличныеИНН Цикл
		ИННОрганизации = КлючИЗначение.Ключ;
		УслугиПоИНН = КлючИЗначение.Значение;
		Организация = БронированиеКомандировокРасширенный.ОрганизацияПоИНН(ИННОрганизации);
		Если Организация.Пустая() Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не обнаружена организация (ИНН %1).
		              |Организация встречается в загружаемых заказах, но такие заказы не будут загружены.'"),
				ИННОрганизации);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		Для Каждого Услуга Из УслугиПоИНН Цикл
			Услуга.Организация = Организация;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
	
Процедура РазбитьПоездкиПоОрганизациям(Поездки)
	
	Индекс = 0;
	Пока Индекс < Поездки.Количество() Цикл
		Поездка = Поездки[Индекс];
		Если Поездка.Услуги.Количество() = 0 Тогда
			// Оказалось, что у поездки нет услуг.
			Поездки.Удалить(Поездка);
			Продолжить;
		КонецЕсли;
		Организации = ОбщегоНазначения.ВыгрузитьКолонку(Поездка.Услуги, "Организация", Истина);
		Если Организации.Количество() = 1 Тогда
			Поездка.Организация = Организации[0];
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
		Для Каждого Организация Из Организации Цикл
			Если Не ЗначениеЗаполнено(Поездка.Организация) Тогда
				// Оригинальную поездку оставляем с первой же организацией.
				Поездка.Организация = Организация;
				Продолжить;
			КонецЕсли;
			// Для всех последующих организаций создаем копии поездки и переносим относящиеся к организации услуги.
			НоваяПоездка = Поездки.Вставить(Индекс + 1);
			ЗаполнитьЗначенияСвойств(НоваяПоездка, Поездка);
			НоваяПоездка.Организация = Организация;
			ОтборСтрок = Новый Структура("Организация");
			ОтборСтрок.Организация = Организация;
			НоваяПоездка.Услуги = Поездка.Услуги.Скопировать(ОтборСтрок);
			НайденныеСтроки = Поездка.Услуги.НайтиСтроки(ОтборСтрок);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Поездка.Услуги.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПодобратьСуществующиеКомандировки(Поездки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поездки", Поездки);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Поездки.ИдентификаторПоездки КАК ИдентификаторПоездки,
		|	Поездки.Организация КАК Организация,
		|	Поездки.СистемаБронирования КАК СистемаБронирования
		|ПОМЕСТИТЬ ВТПоездки
		|ИЗ
		|	&Поездки КАК Поездки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Командировки.ИдентификаторПоездки КАК ИдентификаторПоездки,
		|	Командировки.Командировка КАК Командировка,
		|	Командировки.Организация КАК Организация,
		|	Командировки.СистемаБронирования КАК СистемаБронирования
		|ИЗ
		|	РегистрСведений.КомандировкиВСистемеБронирования КАК Командировки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоездки КАК Поездки
		|		ПО (Поездки.ИдентификаторПоездки = Командировки.ИдентификаторПоездки)
		|			И (Поездки.Организация = Командировки.Организация)
		|			И (Поездки.СистемаБронирования = Командировки.СистемаБронирования)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Командировки = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Командировка");
	
	ДанныеКомандировок = Документы.Командировка.ДанныеКомандировок(Командировки);
	ДанныеКомандировокГруппой = Документы.КомандировкиСотрудников.ДанныеКомандировок(Командировки);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ДанныеКомандировок, ДанныеКомандировокГруппой);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтборСтрок = Новый Структура(
			"ИдентификаторПоездки, 
			|Организация,
			|СистемаБронирования");
		ЗаполнитьЗначенияСвойств(ОтборСтрок, Выборка);
		НайденныеПоездки = Поездки.НайтиСтроки(ОтборСтрок);
		Для Каждого Поездка Из НайденныеПоездки Цикл
			Поездка.Командировка = Выборка.Командировка;
			СравнитьДанныеПоездки(Поездка, ДанныеКомандировок[Выборка.Командировка]);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура СравнитьДанныеПоездки(Поездка, ДанныеКомандировки)
	
	Поездка.Изменена = Ложь;
	Поездка.ОписаниеИзменений = Неопределено;
	
	ПроверитьОтменуПоездки(Поездка, ДанныеКомандировки);
	
	Если Поездка.Отменена Тогда
		Возврат;
	КонецЕсли;
	
	СравнитьДлительностьПоездки(Поездка, ДанныеКомандировки);
	СравнитьМестоНазначенияПоездки(Поездка, ДанныеКомандировки);
	СравнитьСоставСотрудниковПоездки(Поездка, ДанныеКомандировки);
	
	Если Не Поездка.Изменена Тогда
		Возврат;
	КонецЕсли;
	
	Поездка.ОписаниеИзменений = НСтр("ru = 'Отличия поездки от приказа:'") + Символы.ПС + Поездка.ОписаниеИзменений;
	
КонецПроцедуры

Процедура ПроверитьОтменуПоездки(Поездка, ДанныеКомандировки)
	
	Если Не Поездка.Отменена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеКомандировки.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Поездка отменена (но приказ проведен)'");
	ДобавитьОписаниеИзменений(Поездка, ТекстСообщения);
	
КонецПроцедуры

Процедура СравнитьДлительностьПоездки(Поездка, ДанныеКомандировки)
	
	ДлительностьПоездки = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(Поездка.ДатаНачала, Поездка.ДатаОкончания);
	ДлительностьКомандировки = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(ДанныеКомандировки.ДатаНачала, ДанныеКомандировки.ДатаОкончания);
	
	Если ДлительностьПоездки = ДлительностьКомандировки Тогда
		Если НачалоДня(Поездка.ДатаНачала) <> НачалоДня(ДанныеКомандировки.ДатаНачала) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '- даты поездки: %1 (в приказе %2)'"),
				ПредставлениеПериодаПоездки(Поездка),
				ПредставлениеПериодаПоездки(ДанныеКомандировки));
			ДобавитьОписаниеИзменений(Поездка, ТекстСообщения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Шаблон = БронированиеКомандировокРасширенный.ШаблонПредставленияДней();
	
	ПредставлениеДнейПоездки = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(Шаблон, ДлительностьПоездки);
	ПредставлениеДнейКомандировки = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(Шаблон, ДлительностьКомандировки);
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '- длительность поездки: %1 (в приказе %2)'"),
		ПредставлениеДнейПоездки,
		ПредставлениеДнейКомандировки);
		
	ДобавитьОписаниеИзменений(Поездка, ТекстСообщения);
	
КонецПроцедуры

Процедура СравнитьМестоНазначенияПоездки(Поездка, ДанныеКомандировки)
	
	Если СокрЛП(Поездка.МестоНазначения) = СокрЛП(ДанныеКомандировки.МестоНазначения) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '- место назначения: %1 (в приказе %2)'"),
		Поездка.МестоНазначения,
		ДанныеКомандировки.МестоНазначения);
	ДобавитьОписаниеИзменений(Поездка, ТекстСообщения);
	
КонецПроцедуры

Процедура СравнитьСоставСотрудниковПоездки(Поездка, ДанныеКомандировки)
	
	ФизическиеЛицаПоездки = Поездка.ФизическиеЛица.ВыгрузитьКолонку("Ссылка");
	ФизическиеЛицаКомандировки = ФизическиеЛицаКомандировки(ДанныеКомандировки);
	
	Если ОбщегоНазначения.КоллекцииИдентичны(ФизическиеЛицаПоездки, ФизическиеЛицаКомандировки) Тогда
		Возврат;
	КонецЕсли;
	
	Добавленные = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ФизическиеЛицаПоездки, ФизическиеЛицаКомандировки);
	Удаленные = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ФизическиеЛицаКомандировки, ФизическиеЛицаПоездки);
	
	Если Добавленные.Количество() = 0 И Удаленные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьОписаниеИзменений(Поездка, НСтр("ru = '- сотрудники'"));
	
	Если Добавленные.Количество() > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'добавлены: %1'"),
			СтрСоединить(Добавленные, ", "));
		ДобавитьОписаниеИзменений(Поездка, ТекстСообщения);
	КонецЕсли;
	
	Если Удаленные.Количество() > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'исключены: %1'"),
			СтрСоединить(Удаленные, ", "));
		ДобавитьОписаниеИзменений(Поездка, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОписаниеИзменений(Поездка, ТекстСообщения)
	
	Если ЗначениеЗаполнено(Поездка.ОписаниеИзменений) Тогда
		Поездка.ОписаниеИзменений = Поездка.ОписаниеИзменений + Символы.ПС;
	КонецЕсли;
	
	Поездка.ОписаниеИзменений = Поездка.ОписаниеИзменений + ТекстСообщения;
	Поездка.Изменена = Истина;
	
КонецПроцедуры

Функция ФизическиеЛицаКомандировки(ДанныеКомандировки)
	
	Массив = Новый Массив;
	
	Если Не ДанныеКомандировки.Свойство("Командировки") Тогда
		Массив.Добавить(ДанныеКомандировки.ФизическоеЛицо);
	Иначе
		Для Каждого КлючИЗначение Из ДанныеКомандировки.Командировки Цикл
			Массив.Добавить(КлючИЗначение.Значение.ФизическоеЛицо);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

Процедура ПодобратьСотрудников(Поездки)
	
	ФизическиеЛица = Новый ТаблицаЗначений;
	ФизическиеЛица.Колонки.Добавить("ФизическоеЛицо");
	ФизическиеЛица.Колонки.Добавить("Организация");
	ФизическиеЛица.Колонки.Добавить("СтрокаТаблицы");
	
	НачалоПериода = Неопределено;
	ОкончаниеПериода = Неопределено;
	
	Для Каждого Поездка Из Поездки Цикл
		Для Каждого Услуга Из Поездка.Услуги Цикл
			Для Каждого ОписаниеЛица Из Услуга.ФизическиеЛица Цикл
				Если Не ЗначениеЗаполнено(ОписаниеЛица.Ссылка) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока = ФизическиеЛица.Добавить();
				НоваяСтрока.ФизическоеЛицо = ОписаниеЛица.Ссылка;
				НоваяСтрока.Организация = Услуга.Организация;
				НоваяСтрока.СтрокаТаблицы = ОписаниеЛица;
				УточнитьНачалоПериода(НачалоПериода, Поездка);
				УточнитьОкончаниеПериода(ОкончаниеПериода, Поездка);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыСотрудников.НачалоПериода = НачалоПериода;
	ПараметрыСотрудников.ОкончаниеПериода = ОкончаниеПериода;
	ПараметрыСотрудников.СписокФизическихЛиц = ФизическиеЛица.ВыгрузитьКолонку("ФизическоеЛицо");
	ПараметрыСотрудников.КадровыеДанные = "Организация";
	
	ТаблицаСотрудников = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыСотрудников);
	
	ОтборСтрок = Новый Структура(
		"ФизическоеЛицо,
		|Организация");
	
	Для Каждого СтрокаСотрудников Из ТаблицаСотрудников Цикл
		ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаСотрудников);
		СтрокиФизическогоЛица = ФизическиеЛица.НайтиСтроки(ОтборСтрок);
		Для Каждого СтрокаФизическогоЛица Из СтрокиФизическогоЛица Цикл
			СтрокаФизическогоЛица.СтрокаТаблицы.СотрудникСсылка = СтрокаСотрудников.Сотрудник;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура СобратьФизическихЛицПоездки(Поездки)
	
	Для Каждого Поездка Из Поездки Цикл
		Поездка.ФизическиеЛица = БронированиеКомандировок.ТаблицаФизическихЛиц(Ложь);
		Для Каждого Услуга Из Поездка.Услуги Цикл
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Услуга.ФизическиеЛица, Поездка.ФизическиеЛица);
		КонецЦикла;
		СвернутьТаблицуФизическихЛиц(Поездка.ФизическиеЛица);
	КонецЦикла;
	
КонецПроцедуры

Процедура СвернутьТаблицуФизическихЛиц(ФизическиеЛица)
	
	ИменаКолонок = ОбщегоНазначения.ВыгрузитьКолонку(ФизическиеЛица.Колонки, "Имя");
	ИменаСтрокой = СтрСоединить(ИменаКолонок, ",");
	ФизическиеЛица.Свернуть(ИменаСтрокой);
	
КонецПроцедуры

Процедура УточнитьНачалоПериода(НачалоПериода, Поездка)
	
	Если НачалоПериода = Неопределено Тогда
		НачалоПериода = Поездка.ДатаНачала;
		Возврат;
	КонецЕсли;
	
	НачалоПериода = Мин(Поездка.ДатаНачала, НачалоПериода);
	
КонецПроцедуры

Процедура УточнитьОкончаниеПериода(ОкончаниеПериода, Поездка)
	
	Если ОкончаниеПериода = Неопределено Тогда
		ОкончаниеПериода = Поездка.ДатаОкончания;
		Возврат;
	КонецЕсли;
	
	ОкончаниеПериода = Макс(Поездка.ДатаОкончания, ОкончаниеПериода);
	
КонецПроцедуры

Процедура ЗаполнитьПредставлениеПоездок(Поездки)
	
	ЛицаДляПредставления = БронированиеКомандировок.ТаблицаФизическихЛиц();
	
	Для Каждого Поездка Из Поездки Цикл
		ДобавитьПериодПоездкиКПредставлению(Поездка);
		ЗаполнитьПредставлениеФизическихЛиц(Поездка);
		ЗаполнитьПредставлениеУслуг(Поездка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПериодПоездкиКПредставлению(Поездка)
	
	ПредставлениеПериода = ПредставлениеПериодаБронирования(Поездка.ДатаНачала, Поездка.ДатаОкончания);
	Поездка.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1, %2",
		Поездка.Представление,
		ПредставлениеПериода);
	
КонецПроцедуры

Процедура ЗаполнитьПредставлениеФизическихЛиц(Поездка)
	
	ЛицаПоездки = "";
	ЛицаВУслугахРазличаются = Ложь;
	
	Для Каждого Услуга Из Поездка.Услуги Цикл
		ЛицаУслуги = "";
		Для Каждого ОписаниеЛица Из Услуга.ФизическиеЛица Цикл
			СтруктураЛица = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ОписаниеЛица);
			ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СтруктураЛица);
			ЛицаУслуги = ЛицаУслуги + ФамилияИнициалы + ", ";
			Если СтрНайти(ЛицаПоездки, ФамилияИнициалы) = 0 Тогда
				Если Не ПустаяСтрока(ЛицаПоездки) Тогда
					ЛицаВУслугахРазличаются = Истина;
				КонецЕсли;
				ЛицаПоездки = ЛицаПоездки + ФамилияИнициалы + ", ";
			КонецЕсли;
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ЛицаУслуги, 2);
		Услуга.ФизическиеЛицаПредставление = ЛицаУслуги;
	КонецЦикла;
	
	Если Не ЛицаВУслугахРазличаются Тогда
		Поездка.Услуги.ЗаполнитьЗначения("", "ФизическиеЛицаПредставление");
	КонецЕсли;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ЛицаПоездки, 2);
	Поездка.ФизическиеЛицаПредставление = ЛицаПоездки;

КонецПроцедуры

Процедура ЗаполнитьПредставлениеУслуг(Поездка)
	
	Для Каждого Услуга Из Поездка.Услуги Цикл
		ЗаполнитьПредставлениеБилета(Услуга);
		ЗаполнитьПредставлениеУслугиПроживания(Услуга);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПредставлениеБилета(Услуга)
	
	Если Услуга.ВидУслуги <> Перечисления.ВидыУслугБронированияКомандировок.Билеты Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПредставлениеАвиаБилета(Услуга);
	ЗаполнитьПредставлениеБилетаНаПоезд(Услуга);
	
КонецПроцедуры

Процедура ЗаполнитьПредставлениеАвиаБилета(Услуга)
	
	Содержимое = Услуга.Содержимое;
	Если Содержимое.ВидТранспорта <> Перечисления.ВидыТранспортаБронированияБилетов.Самолет Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеМаршрута = "";
	Для Каждого Сегмент Из Содержимое.Маршрут Цикл
		ПредставлениеСегмента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 - %2, %3 в %4'"),
			Сегмент.ПунктОтправления,
			Сегмент.ПунктПрибытия,
			Формат(Сегмент.ДатаОтправления, "ДФ='dd.MM.yyyy, ddd'"),
			Формат(Сегмент.ДатаОтправления, "ДФ=ЧЧ:мм"));
		Если Не ПустаяСтрока(ПредставлениеМаршрута) Тогда
			ПредставлениеМаршрута = ПредставлениеМаршрута + Символы.ПС;
		КонецЕсли;
		ПредставлениеМаршрута = ПредставлениеМаршрута + ПредставлениеСегмента;
	КонецЦикла;
	
	Услуга.Представление = ПредставлениеМаршрута;
	
КонецПроцедуры

Процедура ЗаполнитьПредставлениеБилетаНаПоезд(Услуга)
	
	Содержимое = Услуга.Содержимое;
	Если Содержимое.ВидТранспорта <> Перечисления.ВидыТранспортаБронированияБилетов.Поезд Тогда
		Возврат;
	КонецЕсли;
	
	Услуга.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 - %2, %3 в %4'"),
		Содержимое.ПунктОтправления,
		Содержимое.ПунктПрибытия,
		Формат(Содержимое.ДатаОтправления, "ДФ='dd.MM.yyyy, ddd'"),
		Формат(Содержимое.ДатаОтправления, "ДФ=ЧЧ:мм"));
	
КонецПроцедуры

Процедура ЗаполнитьПредставлениеУслугиПроживания(Услуга)
	
	Если Услуга.ВидУслуги <> Перечисления.ВидыУслугБронированияКомандировок.Проживание Тогда
		Возврат;
	КонецЕсли;
	
	Содержимое = Услуга.Содержимое;
	
	ПериодПроживания = ПредставлениеПериодаБронирования(Содержимое.ДатаЗаезда, Содержимое.ДатаВыезда);
	
	Услуга.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Проживание в %1, %2'"),
		Содержимое.МестоПроживания,
		ПериодПроживания);
	
КонецПроцедуры

Функция ПредставлениеПериодаБронирования(ДатаНачала, ДатаОкончания)
	
	ПредставлениеИнтервала = Формат(ДатаНачала, "ДЛФ=D");
	Если НачалоДня(ДатаНачала) <> НачалоДня(ДатаОкончания) Тогда
		ПредставлениеИнтервала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1 - %2", 
			Формат(ДатаНачала, "ДЛФ=D"),
			Формат(ДатаОкончания, "ДЛФ=D"));
	КонецЕсли;
	
	Дней = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(ДатаНачала, ДатаОкончания);
	ПредставлениеДней = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(БронированиеКомандировокРасширенный.ШаблонПредставленияДней(), Дней);
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1 (%2)", ПредставлениеДней, ПредставлениеИнтервала);
	
КонецФункции

#КонецОбласти

#Область ФормированиеКомандировок

Процедура СформироватьКомандировку(ДанныеПоездки)
	
	Если ЗначениеЗаполнено(ДанныеПоездки.Командировка) Тогда
		ИзменитьКомандировку(ДанныеПоездки);
		Возврат;
	КонецЕсли;
	
	Если ДанныеПоездки.ФизическиеЛица.Количество() = 1 Тогда
		СформироватьКомандировкуОдногоСотрудника(ДанныеПоездки);
		Возврат;
	КонецЕсли;
	
	СформироватьКомандировкуГруппыСотрудников(ДанныеПоездки);
	
КонецПроцедуры

Процедура ИзменитьКомандировку(ДанныеПоездки)
	
	Если ТипЗнч(ДанныеПоездки.Командировка) = Тип("ДокументСсылка.Командировка") Тогда
		ИзменитьКомандировкуОдногоСотрудника(ДанныеПоездки);
		Возврат;
	КонецЕсли;
	
	ИзменитьКомандировкуГруппыСотрудников(ДанныеПоездки);
	
КонецПроцедуры

Процедура СформироватьКомандировкуОдногоСотрудника(ДанныеПоездки)
	
	ДокументОбъект = Документы.Командировка.СоздатьДокумент();
	ЗаполнитьКомандировкуОдногоСотрудника(ДокументОбъект, ДанныеПоездки);
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ДанныеПоездки.Командировка = ДокументОбъект.Ссылка;
	
КонецПроцедуры

Процедура ЗаполнитьКомандировкуОдногоСотрудника(ДокументОбъект, ДанныеПоездки)
	
	ЗаполнениеДокумента = Документы.Командировка.ПараметрыЗаполнения();
	ЗаполнениеДокумента.Сотрудник = ДанныеПоездки.ФизическиеЛица[0].СотрудникСсылка;
	ЗаполнениеДокумента.Организация = ДанныеПоездки.Организация;
	ЗаполнениеДокумента.ДатаНачала = ДанныеПоездки.ДатаНачала;
	ЗаполнениеДокумента.ДатаОкончания = ДанныеПоездки.ДатаОкончания;
	ЗаполнениеДокумента.МестоНазначения = ДанныеПоездки.МестоНазначения;
	
	ДокументОбъект.Заполнить(ЗаполнениеДокумента);
	
КонецПроцедуры

Процедура СформироватьКомандировкуГруппыСотрудников(ДанныеПоездки)
	
	ДокументОбъект = Документы.КомандировкиСотрудников.СоздатьДокумент();
	ЗаполнитьКомандировкуГруппыСотрудника(ДокументОбъект, ДанныеПоездки);
	
	ДокументОбъект.Записать();
	
	ДанныеПоездки.Командировка = ДокументОбъект.Ссылка;
	
КонецПроцедуры

Процедура ЗаполнитьКомандировкуГруппыСотрудника(ДокументОбъект, ДанныеПоездки)
	
	ЗаполнениеДокумента = Документы.КомандировкиСотрудников.ПараметрыЗаполнения();
	ЗаполнениеДокумента.Организация = ДанныеПоездки.Организация;
	ЗаполнениеДокумента.ДатаНачала = ДанныеПоездки.ДатаНачала;
	ЗаполнениеДокумента.ДатаОкончания = ДанныеПоездки.ДатаОкончания;
	ЗаполнениеДокумента.МестоНазначения = ДанныеПоездки.МестоНазначения;
	
	СотрудникиПоездки = ДанныеПоездки.ФизическиеЛица.ВыгрузитьКолонку("СотрудникСсылка");
	Для Каждого Сотрудник Из СотрудникиПоездки Цикл
		ЗаполнениеСтроки = Документы.КомандировкиСотрудников.ПараметрыЗаполненияКомандировкиСотрудника();
		ЗаполнениеСтроки.Сотрудник = Сотрудник;
		Если ТипЗнч(ДанныеПоездки.Командировка) = Тип("ДокументСсылка.Командировка") Тогда
			ЗаполнениеСтроки.Командировка = ДанныеПоездки.Командировка;
		КонецЕсли;
		ЗаполнениеДокумента.Сотрудники.Добавить(ЗаполнениеСтроки);
	КонецЦикла;
	
	ДокументОбъект.Заполнить(ЗаполнениеДокумента);
	
КонецПроцедуры

Процедура ИзменитьКомандировкуОдногоСотрудника(ДанныеПоездки)
	
	Если ДанныеПоездки.ФизическиеЛица.Количество() > 1 Тогда
		// Если сотрудников группа, а выбран документ на одного сотрудника.
		СформироватьКомандировкуГруппыСотрудников(ДанныеПоездки);
		Возврат;
	КонецЕсли;
	
	ДокументОбъект = ДанныеПоездки.Командировка.ПолучитьОбъект();

	Попытка
		ДокументОбъект.Заблокировать();
	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Требуется обновить документ %1. 
                  |В данный момент изменение невозможно, так как документ редактируется другим пользователем или в другой форме программы.'"),
			ДанныеПоездки.Командировка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Если ДанныеПоездки.Отменена Тогда
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКомандировкуОдногоСотрудника(ДокументОбъект, ДанныеПоездки);
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ИзменитьКомандировкуГруппыСотрудников(ДанныеПоездки)

	ДокументОбъект = ДанныеПоездки.Командировка.ПолучитьОбъект();

	Попытка
		ДокументОбъект.Заблокировать();
	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Требуется обновить документ %1. 
                  |В данный момент изменение невозможно, так как документ редактируется другим пользователем или в другой форме программы.'"),
			ДанныеПоездки.Командировка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Если ДанныеПоездки.Отменена Тогда
		ДокументОбъект.УстановитьПометкуУдаления(Истина);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКомандировкуГруппыСотрудника(ДокументОбъект, ДанныеПоездки);
	
	ДокументОбъект.Записать();
	
КонецПроцедуры

Процедура СохранитьИдентификаторПоездки(ДанныеПоездки)
	
	НаборЗаписей = РегистрыСведений.КомандировкиВСистемеБронирования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторПоездки.Установить(ДанныеПоездки.ИдентификаторПоездки);
	НаборЗаписей.Отбор.СистемаБронирования.Установить(ДанныеПоездки.СистемаБронирования);
	НаборЗаписей.Отбор.Организация.Установить(ДанныеПоездки.Организация);
	НаборЗаписей.Отбор.Командировка.Установить(ДанныеПоездки.Командировка);
	
	СтрокаНабора = НаборЗаписей.Добавить();
	СтрокаНабора.ИдентификаторПоездки = ДанныеПоездки.ИдентификаторПоездки;
	СтрокаНабора.СистемаБронирования = ДанныеПоездки.СистемаБронирования;
	СтрокаНабора.Командировка = ДанныеПоездки.Командировка;
	СтрокаНабора.Организация = ДанныеПоездки.Организация;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#Область ВерсииЗаказа

Функция ВерсияПоследнегоЗаказа(СистемаБронирования, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СистемаБронирования", СистемаБронирования);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(ВерсияЗаказа.Версия) КАК Версия
		|ИЗ
		|	РегистрСведений.ВерсияЗаказаБронированияКомандировки КАК ВерсияЗаказа
		|ГДЕ
		|	ВерсияЗаказа.СистемаБронирования = &СистемаБронирования
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(ВерсияЗаказа.Версия) ЕСТЬ НЕ NULL ";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		// Добавляем отбор по организации.
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
		ОтборЗапроса.Добавить("ВерсияЗаказа.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Версия;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьВерсиюПоследнегоЗаказа(Версия, СистемаБронирования, Организация) Экспорт
		
	НаборЗаписей = РегистрыСведений.ВерсияЗаказаБронированияКомандировки.СоздатьНаборЗаписей();
	
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.СистемаБронирования = СистемаБронирования;
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.Версия = Версия;
	
	НаборЗаписей.Отбор.СистемаБронирования.Установить(СистемаБронирования);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
#КонецОбласти
